app/controllers/events_controller.rb

  def show
    @event = Event.of_locale_or_default.unexpired.where(:code => params[:id]).first
---
SELECT "events".* FROM "events" WHERE "events"."code" = 'test_event1' AND (events.id in (select b.id from events b where b.code = events.code and b.locale in ( NULL , 'fr' ) order by case when lower(locale) in (NULL) then 1 when lower(locale) = 'fr' then 2 else 3 end, locale limit 1)) AND (events.end_date > '2011-08-04 11:09:50.723866') LIMIT 1