app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."uid" = 'dfbb51ffa5bef3f30f4b43902418fb65' LIMIT 1
UPDATE "users" SET "invitor_id" = 4, "updated_at" = '2011-08-04 11:10:17.453516' WHERE "users"."id" = 6
---
  def edit
    @user = User.find_by_id(params[:id])
    if_is_visitee_then do|uid|
      if is_first_time_signup?
        @invitor = User.callback_invitee!(:signup , session[:invitor_uid] , session[:invited_ec])
        @user.invitor = User.where(:uid => uid ).first
        @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = 6 LIMIT 1
UPDATE "users" SET "firstname" = 'sdf', "zipcode" = 'sdf', "is_opt_in" = 't', "nickname" = 'sdfs', "address" = 'sdfas', "city" = 'adf', "gender" = 'Mme', "country" = 'AF', "birthdate" = '1932-01-03', "lastname" = 'sdf', "updated_at" = '2011-08-04 11:10:56.398639' WHERE "users"."id" = 6
---
  def update
    unless current_user.is_of_role?("administrators")
      @user = User.find_by_id(params[:id])
      if @user.update_attributes(params[:user])